nc: 2 # number of classes
scales:
  s: [1.0, 1.0, 1728]

backbone:
  - [-1, 1, nn.Identity, []] # 0

  # CNN (ConvNeXt Tiny)
  - [0, 1, TorchVision, [768, "convnext_tiny", "DEFAULT", True, 2, True]]  # 1
  - [-1, 1, Index, [192, 4]]  # extracts 4th output (1, 192, 80, 80) - 2
  - [1, 1, Index, [384, 6]]  # extracts 6th output (1, 384, 40, 40) - 3
  - [1, 1, Index, [768, 8]]  # extracts 8th output (1, 768, 20, 20) - 4

  # Swin Transformer
  - [0, 1, TorchVision, [768, swin_t, DEFAULT, True, 4, True]] # 5
  - [-1, 1, Index, [192, 4]] # 6
  - [-1, 1, torchvision.ops.Permute, [[0, 3, 1, 2]]] # 7 (multiscale 1)
  - [5, 1, Index, [384, 6]] # 8
  - [-1, 1, torchvision.ops.Permute, [[0, 3, 1, 2]]] # 9 (multiscale 2)
  - [5, 1, Index, [768, 9]] # 10
  - [-1, 1, torchvision.ops.Permute, [[0, 3, 1, 2]]] # 11 (multiscale 3)

  # Concat features along channel dimension
  - [[2, 7], 1, Concat, [1]] # 12 concat scale 1 (192 + 192 = 384 channels)
  - [-1, 1, EMA, [384]]      # 13 EMA for scale 1

  - [[3, 9], 1, Concat, [1]] # 14 concat scale 2 (384 + 384 = 768 channels)
  - [-1, 1, EMA, [768]]      # 15 EMA for scale 2

  - [[4, 11], 1, Concat, [1]] # 16 concat scale 3 (768 + 768 = 1536 channels)
  - [-1, 1, EMA, [1536]]      # 17 EMA for scale 3

head:
  # Top-Down Pathway
  - [17, 1, nn.Upsample, [None, 2, "nearest"]] # 18 upsample EMA3 output to match H and W with EMA2
  - [[-1, 15], 1, BiFPN_Concat2, [1]] # 19 concat EMA3 + EMA2 (1536 + 768 = 2304 channels)
  - [-1, 1, C3k2, [512, False]] # 20 reduce channels to 512

  - [20, 1, nn.Upsample, [None, 2, "nearest"]] # 21 upsample to match H and W with EMA1
  - [[-1, 13], 1, BiFPN_Concat2, [1]] # 22 concat with EMA1 (512 + 384 = 896 channels)
  - [-1, 1, C3k2, [256, False]] # 23 reduce channels to 256

  # Bottom-Up Pathway
  - [23, 1, DWConv, [256, 3, 2]]    # 24: Downsample
  - [[-1, 20], 1, BiFPN_Concat2, [1]]    # 25: BiFPN Concatenate (256 + 512 = 768 channels)
  - [-1, 1, C3k2, [512, True]]     # 26: C2f (reduce to 512 channels)

  - [26, 1, DWConv, [512, 3, 2]]    # 27: Downsample
  - [[-1, 17], 1, BiFPN_Concat2, [1]]    # 28: Concatenate with EMA3 (512 + 1536 = 2048 channels)
  - [-1, 1, C3k2, [1024, True]]    # 29: C2f (reduce to 1024 channels)

  # Detection
  - [[23, 26, 29], 1, RTDETRDecoder, [nc]]  # 30: Detect(P3, P4, P5)
