# Parameters
nc: 80  # number of classes
scales:
  # [depth_multiple, width_multiple]
  small: [0.5, 0.5]
  large: [1.0, 1.0]
  custom: [0.75, 0.75]

# YOLOv8 backbone (MobileNetV3 with scaling)
backbone:
  # [from, repeats, module, args]
  #  c1, c2, exp, k, s, use_se, n, act
  - [-1, 1, MobileNetV3Stem, [3, 16, 3, 2, 1, True]]   # 0-P1/2, Initial Conv

  # MobileNetV3-Small-like (using 'small' scale)
  - [-1, 1, MobileNetV3Layer, [16, 16, 16, 3, 2, True, 1, True, 0.5, 0.5]]  # 1-P2/4
  - [-1, 1, MobileNetV3Layer, [16, 24, 72, 3, 2, False, 1, True, 0.5, 0.5]] # 2-P3/8
  - [-1, 1, MobileNetV3Layer, [24, 24, 88, 3, 1, False, 1, True, 0.5, 0.5]]
  - [-1, 1, MobileNetV3Layer, [24, 40, 96, 5, 2, True, 1, True, 0.5, 0.5]]  # 3-P4/16
  - [-1, 1, MobileNetV3Layer, [40, 40, 240, 5, 1, True, 1, True, 0.5, 0.5]]
  - [-1, 1, MobileNetV3Layer, [40, 40, 240, 5, 1, True, 1, True, 0.5, 0.5]]
  - [-1, 1, MobileNetV3Layer, [40, 48, 120, 5, 1, True, 1, True, 0.5, 0.5]]
  - [-1, 1, MobileNetV3Layer, [48, 48, 144, 5, 1, True, 1, True, 0.5, 0.5]]
  - [-1, 1, MobileNetV3Layer, [48, 96, 288, 5, 2, True, 1, True, 0.5, 0.5]] # 4-P5/32
  - [-1, 1, MobileNetV3Layer, [96, 96, 576, 5, 1, True, 1, True, 0.5, 0.5]]
  - [-1, 1, MobileNetV3Layer, [96, 96, 576, 5, 1, True, 1, True, 0.5, 0.5]]


# YOLOv8 head (adapted for MobileNetV3-Small)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 9], 1, Concat, [1]]  # cat backbone P5 (layer 9)
  - [-1, 3, C2f, [256]]        # Adjusted channels

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 3], 1, Concat, [1]]  # cat backbone P4 (layer 3)
  - [-1, 3, C2f, [128]]        # Adjusted channels

  - [-1, 1, Conv, [128, 3, 2]] # Downsample to match P4
  - [[-1, 12], 1, Concat, [1]]   # cat with upsampled P4 path (layer 12)
  - [-1, 3, C2f, [128]]

  - [-1, 1, Conv, [128, 3, 2]] # Downsample to match P5
  - [[-1, 9], 1, Concat, [1]] # cat with P5 (layer 9)
  - [-1, 3, C2f, [256]]

  - [[15, 18, 21], 1, Detect, [nc]]  # Detect(P3, P4, P5) - Correct layer indices