nc: 2
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # l: [1.00, 1.00, 1024] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  # n: [0.33, 0.25, 1024] # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.25, 1024] # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  # m: [0.67, 0.75, 768] # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  # l: [1.00, 1.00, 512] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  # x: [1.00, 1.25, 512] # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs


# YOLOv8.0n backbone
backbone:

  - [-1, 1, nn.Identity, []] #0  
  # Swin track
  - [0, 1, TorchVision, [768, swin_t, DEFAULT, True, 4, True]] #1
  - [-1, 1, Index, [192 ,4]] #2
  - [-1, 1, torchvision.ops.Permute, [[0, 3, 1, 2]]] #3 (1, 192, 80, 80) multiscale 1 (96) 
  - [1, 1, Index, [384, 6]] #4
  - [-1, 1, torchvision.ops.Permute, [[0, 3, 1, 2]]] #5 (1, 384, 40, 40) multiscale 2 (192)
  - [1, 1, Index, [768, 9]] #6 
  - [-1, 1, torchvision.ops.Permute, [[0, 3, 1, 2]]] #7 (1, 768, 20, 20) (384)
  # - [-1, 1, EMA, [768]] #8 multiscale 3
  # - [-1, 1, EMA, [48]] #8 multiscale 3
  # - [5, 1, EMA, [96]] #8 multiscale 3
  # - [3, 1, EMA, [192]] #8 multiscale 3
  # CNN
  - [0, 1, DWConv, [64, 3, 2]] # (1, 64, 320, 320) 8 (32)
  - [-1, 1, DWConv, [128, 3, 2]] # (1, 128, 160, 160) 9 (64)
  - [-1, 3, DWC3k2, [128, True]] # (1, 128, 160, 160) 10 (64))
  - [-1, 1, DWConv, [256, 3, 2]] # (1, 256, 80, 80) 11 (128))
  - [-1, 6, DWC3k2, [256, True]] # (1, 256, 80, 80) 12 multiscale 1 (128)
  - [-1, 1, DWConv, [512, 3, 2]] # (1, 512, 40, 40) 13 (256)
  - [-1, 6, DWC3k2, [512, True]] # (1, 512, 40, 40) 14 multiscale 2 (256)
  - [-1, 1, DWConv, [1024, 3, 2]] # (1, 1024, 20, 20) 15 (512)
  - [-1, 3, DWC3k2, [1024, True]] # (1, 1024, 20, 20) 16 (512)
  # - [-1, 1, EMA, [256]] #(1, 1024, 20, 20) 18 multiscale 3 (344)

  # #Concat
  # - [3, 1, DWConv, [128, 1, 1]] #19 (1, 192, 80, 80) -> (1, 128, 80, 80)
  # - [13, 1, DWConv, [128, 1, 1]] #20 (1, 256, 80, 80) -> (1, 128, 80, 80)
  - [[3, 12], 1, Concat, [1]] # 17 (1, 256, 80, 80) 448 (224)
  # - [-1, 1, EMA, [320]]  #18
  # - [-1, 1, EMA, [224]] #8 multiscale 3

  # - [5, 1, DWConv, [128, 1, 1]] #22 (1, 384, 40, 40) -> (1, 128, 40, 40)
  # - [15, 1, DWConv, [128, 1, 1]] # 23 (1, 512, 40, 40) -> (1, 128, 40, 40)
  - [[5, 14], 1, Concat, [1]] # 18 (1, 256, 40, 40) (445)
  # - [-1, 1, EMA, [640]] #20
  # - [-1, 1, EMA, [448]] #8 multiscale 3

  # - [8, 1, DWConv, [256, 1, 1]] #25 (1, 768, 20, 20) -> (1, 256, 20, 20)
  # - [18, 1, DWConv, [256, 1, 1]] #26 (1, 1024, 20, 20) -> (1, 256, 20, 20)
  - [[7, 16], 1, Concat, [1]] #19 (1, 512, 20, 20) (896)
  # - [-1, 1, EMA, [1280]]  #22
  # - [-1, 1, EMA, [304]] #8 multiscale 3

# YOLOv8.0n head
head:
  # - [-1, 1, nn.Identity, []]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #20
  - [[-1, 18], 1, Concat, [1]] # 21
  - [-1, 3, DWC3k2, [512]] # 22

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #23
  - [[-1, 17], 1, Concat, [1]] # 24
  - [-1, 3, DWC3k2, [256]] # 25

  - [-1, 1, DepthwiseConvBlock, [256, 3, 2]] #26
  - [[-1, 22], 1, Concat, [1]] # 27
  - [-1, 3, DWC3k2, [512, True]] # 28

  - [-1, 1, DepthwiseConvBlock, [512, 3, 2]] #29
  - [[-1, 19], 1, Concat, [1]] # 30
  - [-1, 3, DWC3k2, [1024, True]] # 31

  - [[25, 28, 31], 1, Detect, [nc]] # 32
