# Model Parameters
nc: 2  # Number of classes (adjust as needed)
strides: [8, 16, 32]  # Output strides
scales:
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # You can adjust these scales
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8-Swin-T Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, TorchVision, [768, swin_t, DEFAULT, True, 5, True]]    # 0 - Swin-T (truncated, split)
  # Extract feature maps at different scales
  - [0, 1, Index, [192, 4]]                                        # 1 - P3/8  (B, 80, 80, 192)
  - [-1, 1, torchvision.ops.Permute, [[0, 3, 1, 2]]]                               # 2 - P3/8  (B, 192, 80, 80)
  - [0, 1, Index, [384, 6]]                                        # 3 - P4/16 (B, 40, 40, 384)
  - [-1, 1, torchvision.ops.Permute, [[0, 3, 1, 2]]]                               # 4 - P4/16 (B, 384, 40, 40)
  - [0, 1, Index, [768, 8]]                                        # 5 - P5/32 (B, 20, 20, 768)
  - [-1, 1, torchvision.ops.Permute, [[0, 3, 1, 2]]]                               # 6 - P5/32 (B, 768, 20, 20)
  - [-1, 1, SPPF, [768, 5]]                                        # 7 - P5/32 (B, 768, 20, 20)

head:
  # [from, repeats, module, args]

  # --- FPN (Top-Down) Pathway ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]                       # 8 - (B, 768, 40, 40)
  - [[-1, 4], 1, Concat, [1]]                                      # 9 - (B, 1152, 40, 40)
  - [-1, 3, C2f, [384, True]]                                    # 10 - (B, 384, 40, 40)  FPN P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]                       # 11 - (B, 384, 80, 80)
  - [[-1, 2], 1, Concat, [1]]                                      # 12 - (B, 576, 80, 80)
  - [-1, 3, C2f, [192, True]]                                    # 13 - (B, 192, 80, 80)  FPN P3

  # --- PANet (Bottom-Up) Pathway ---
  - [-1, 1, Conv, [192, 3, 2]]                                     # 14 - (B, 192, 40, 40) Downsample P3
  - [[-1, 10], 1, Concat, [1]]                                     # 15 - (B, 576, 40, 40) Concatenate with FPN P4
  - [-1, 3, C2f, [384, True]]                                    # 16 - (B, 384, 40, 40) PANet P4

  - [-1, 1, Conv, [384, 3, 2]]                                     # 17 - (B, 384, 20, 20) Downsample P4
  - [[-1, 7], 1, Concat, [1]]                                     # 18 - (B, 1152, 20, 20) Concatenate with Backbone P5
  - [-1, 3, C2f, [768, True]]                                    # 19 - (B, 768, 20, 20) PANet P5

  # --- Detection Head ---
  - [[13, 16, 19], 1, Detect, [nc]]                               # 20 - Detect(P3, P4, P5)
