# YOLOv8-MobileNetv3-PANet
# Based on YOLOv8n, but with MobileNetv3-Large backbone and a PANet-like neck

# Model Parameters
nc: 80  # Number of classes (adjust as needed)
strides: [8, 16, 32]  # Output strides
scales:
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # You can adjust these scales
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8-MobileNetv3 Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, TorchVision, [mobilenet_v3_large, DEFAULT, True, 2, True]]  # 0 - MobileNetv3 (truncated, split)
  # Extract feature maps at different scales (adjust indices based on MobileNetv3's structure)
  - [0, 1, Index, [40, 7]]                                                  # 1 - P3/8  (B, 80, 80, 40)
  - [0, 1, Index, [112, 13]]                                                 # 2 - P4/16 (B, 40, 40, 112)
  - [0, 1, Index, [960, 17]]                                                 # 3 - P5/32 (B, 20, 20, 960)
  - [-1, 1, SPPF, [960, 5]]                                                  # 4 - P5/32 (B, 960, 20, 20)

# YOLOv8-MobileNetv3 Head (PANet-like)
head:
  # [from, repeats, module, args]

  # --- FPN (Top-Down) Pathway ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 5 - (B, 960, 40, 40)
  - [[-1, 2], 1, Concat, [1]]                 # 6 - (B, 960+112, 40, 40) = (B, 1072, 40, 40)
  - [-1, 3, C2f, [112, True]]                  # 7 - (B, 112, 40, 40)  FPN P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 8 - (B, 112, 80, 80)
  - [[-1, 1], 1, Concat, [1]]                 # 9 - (B, 112+40, 80, 80) = (B, 152, 80, 80)
  - [-1, 3, C2f, [40, True]]                   # 10 - (B, 40, 80, 80) FPN P3

  # --- PANet (Bottom-Up) Pathway ---
  - [-1, 1, Conv, [40, 3, 2]]                   # 11 - (B, 40, 40, 40) Downsample P3
  - [[-1, 7], 1, Concat, [1]]                  # 12 - (B, 40+112, 40, 40) = (B, 152, 40, 40)
  - [-1, 3, C2f, [112, True]]                  # 13 - (B, 112, 40, 40) PANet P4

  - [-1, 1, Conv, [112, 3, 2]]                  # 14 - (B, 112, 20, 20) Downsample P4
  - [[-1, 4], 1, Concat, [1]]                  # 15 - (B, 112+960, 20, 20) = (B, 1072, 20, 20)
  - [-1, 3, C2f, [960, True]]                  # 16 - (B, 960, 20, 20) PANet P5

  # --- Detection Head ---
  - [[10, 13, 16], 1, Detect, [nc]]              # 17 - Detect(P3, P4, P5)
