nc: 1
backbone:
  # - [-1, 1, TorchVision, [768, swin_t, "DEFAULT", True, 4, True]]
  - [-1, 1, TorchVision, [960, mobilenet_v3_large, "DEFAULT", True, 2, True]]  # 0
  - [-1, 1, TorchVision, [768, swin_t, DEFAULT, True, 5, True]]
head:
  - [-1, 1, nn.Identity, []]
