nc: 2 # number of classes
scales:
  # s: [0.33, 0.50, 1024]

backbone:
  # Input image placeholder
  - [-1, 1, nn.Identity, []] #0
  
  # CNN track (ConvNeXt Tiny)
  - [0, 1, TorchVision, [768, convnext_tiny, "DEFAULT", True, 4, True]]  # 1 (outputs 768 channels at final stage)
  - [-1, 1, Index, [192, 4]]  # 2 multiscale 1 
  - [1, 1, Index, [384, 6]]  # 3 multiscale 2 
  - [1, 1, Index, [768, 8]]  # 4 
  - [-1, 1, SPPF, [768, 8]]  # 5 multiscale 3 (SPPF on 768 channels)
  
head:
  -[[2, 3, 5], 1, Detect, [nc]]
