nc: 2
scales:
  s: [0.33, 0.25, 1024] 
  
backbone:
  - [-1, 1, nn.Identity, []] #0  
  # Swin track
  - [0, 1, TorchVision, [768, swin_t, DEFAULT, True, 4, True]] #1
  - [-1, 1, Index, [192 ,4]] #2
  - [-1, 1, torchvision.ops.Permute, [[0, 3, 1, 2]]] #3 (1, 192, 80, 80) multiscale 1  
  - [1, 1, Index, [384, 6]] #4
  - [-1, 1, torchvision.ops.Permute, [[0, 3, 1, 2]]] #5 (1, 384, 40, 40) multiscale 2 
  - [1, 1, Index, [768, 9]] #6 
  - [-1, 1, torchvision.ops.Permute, [[0, 3, 1, 2]]] #7 (1, 768, 20, 20)
  - [-1, 1, SPPF, [768, 5]] #8 multiscale 3

    # CNN
  - [0, 1, Conv, [64, 3, 2]] # 9 (1, 64, 320, 320) - (16)
  - [-1, 1, Conv, [128, 3, 2]] # 10 (1, 128, 160, 160) - (32)
  - [-1, 2, DWC3k2, [256, False, 0.25]] # 11 (1, 256, 80, 80) - (64)
  - [-1, 1, Conv, [256, 3, 2]] # 12 (1, 256, 80, 80) - (64) - multiscale 1
  - [-1, 2, DWC3k2, [512, False, 0.25]] #13 (1, 512, 40, 40) - (128)
  - [-1, 1, Conv, [512, 3, 2]] # 14 (1, 512, 40, 40) - (128)
  - [-1, 2, DWC3k2, [512, True]] #15 (1, 512, 40, 40) - (128) - multiscale 2
  - [-1, 1, Conv, [1024, 3, 2]] # 16 (1, 1024, 20, 20) - (256)
  - [-1, 2, DWC3k2, [1024, True]] #17 (1, 1024, 20, 20) - (256)
  - [-1, 1, SPPF, [1024, 5]] #18 multisclae 3
    
  #Concat
  - [[3, 12], 1, Concat, [1]] # 19 (1, 448, 80, 80)  (256)
  - [-1, 1, ECA, []]  #20
  
  - [[5, 15], 1, Concat, [1]] # 21 (1, 896, 40, 40) (512)
  - [-1, 1, ECA, []] #22

  - [[8, 18], 1, Concat, [1]] #23 (1, 1792, 20, 20) (1024)
  - [-1, 1, ECA, []]  #24

head:
#BiFPN BLOCK 1
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #25
  - [[-1, 22], 1, Concat, [1]] # 26 1024+512 = 1536
  - [-1, 3, DWC3k2, [512]] # 27 128

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #28
  - [[-1, 20], 1, Concat, [1]] # 29
  - [-1, 3, DWC3k2, [256]] # 30

  - [-1, 1, nn.Upsample, [None, 0.5, "nearest"]] #31
  - [[-1, 27], 1, Concat, [1]] # 32
  - [[-1, 22], 1, Concat, [1]] # 32 33
  - [-1, 3, DWC3k2, [512, True]] # 33 34

  - [-1, 1, nn.Upsample, [None, 0.5, "nearest"]] #34 35
  - [[-1, 24], 1, Concat, [1]] # 35 36
  - [-1, 3, DWC3k2, [1024, True]] # 36 37

#BiFPN Block 2
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #37 38
  - [[-1, 34], 1, Concat, [1]] # 38 39
  - [-1, 3, DWC3k2, [512]] # 39 40

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #40 41
  - [[-1, 30], 1, Concat, [1]] # 41 42
  - [-1, 3, DWC3k2, [256]] # 42 43

  - [-1, 1, nn.Upsample, [None, 0.5, "nearest"]] #43 44
  - [[-1, 40], 1, Concat, [1]] # 44 45
  - [[-1, 34], 1, Concat, [1]] # 44 46
  - [-1, 3, DWC3k2, [512, True]] # 45 47

  - [-1, 1, nn.Upsample, [None, 0.5, "nearest"]] #46 48
  - [[-1, 37], 1, Concat, [1]] # 47 49
  - [-1, 3, DWC3k2, [1024, True]] # 48 50

#BiFPN BLock 3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #49 51
  - [[-1, 47], 1, Concat, [1]] # 50 52
  - [-1, 3, DWC3k2, [512]] # 51 53

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #52 54
  - [[-1, 43], 1, Concat, [1]] # 53 55
  - [-1, 3, DWC3k2, [256]] # 54 56

  - [-1, 1, nn.Upsample, [None, 0.5, "nearest"]] #55 57
  - [[-1, 53], 1, Concat, [1]] # 56 58
  - [[-1, 47], 1, Concat, [1]] # 56 59
  - [-1, 3, DWC3k2, [512, True]] # 57 60

  - [-1, 1, nn.Upsample, [None, 0.5, "nearest"]] #58 61
  - [[-1, 50], 1, Concat, [1]] # 59 62
  - [-1, 3, DWC3k2, [1024, True]] # 60 63

  - [[56, 60, 63], 1, Detect, [nc]] # 61 64
