nc: 2
scales:
  s: [0.33, 0.5, 1024] 
  
backbone:
  - [-1, 1, nn.Identity, []] #0  
    # CNN
  - [0, 1, Conv, [64, 3, 2]] # 1 (1, 64, 320, 320) - (16)
  - [-1, 1, Conv, [128, 3, 2]] # 2 (1, 128, 160, 160) - (32)
  - [-1, 2, DWC3k2, [256, False, 0.25]] # 3 (1, 256, 80, 80) - (64)
  - [-1, 1, Conv, [256, 3, 2]] # 4 (1, 256, 80, 80) - (64) - multiscale 1
  - [-1, 2, DWC3k2, [512, False, 0.25]] #5 (1, 512, 40, 40) - (128)
  - [-1, 1, Conv, [512, 3, 2]] # 6 (1, 512, 40, 40) - (128)
  - [-1, 2, DWC3k2, [512, True]] #7 (1, 512, 40, 40) - (128) - multiscale 2
  - [-1, 1, Conv, [1024, 3, 2]] # 8 (1, 1024, 20, 20) - (256)
  - [-1, 2, DWC3k2, [1024, True]] #9 (1, 1024, 20, 20) - (256)
  - [-1, 1, SPPF, [1024, 5]] #10 multisclae 3

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #11
  - [[-1, 7], 1, Concat, [1]] # 12 1024+512 = 1536
  - [-1, 3, C3k2, [512]] # 13 128

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #14
  - [[-1, 4], 1, Concat, [1]] # 15
  - [-1, 3, C3k2, [256]] # 16

  - [-1, 1, Conv, [256, 3, 2]] #17
  - [[-1, 13], 1, Concat, [1]] #18
  - [-1, 3, C3k2, [512, True]] #19

  - [-1, 1, Conv, [512, 3, 2]] #20
  - [[-1, 10], 1, Concat, [1]] # 21
  - [-1, 3, C3k2, [1024, True]] # 22

  - [[22, 19, 16], 1, Detect, [nc]] # 23
