nc: 2
scales:
  s: [0.33, 0.5, 1024] 
  
backbone:
  - [-1, 1, nn.Identity, []] #0  
  # Swin track
  - [0, 1, TorchVision, [768, swin_t, DEFAULT, True, 4, True]] #1
  - [-1, 1, Index, [192 ,4]] #2
  - [-1, 1, torchvision.ops.Permute, [[0, 3, 1, 2]]] #3 (1, 192, 80, 80) multiscale 1  
  - [1, 1, Index, [384, 6]] #4
  - [-1, 1, torchvision.ops.Permute, [[0, 3, 1, 2]]] #5 (1, 384, 40, 40) multiscale 2 
  - [1, 1, Index, [768, 9]] #6 
  - [-1, 1, torchvision.ops.Permute, [[0, 3, 1, 2]]] #7 (1, 768, 20, 20)
  - [-1, 1, SPPF, [768, 5]] #8 multiscale 3

    # CNN
  - [0, 1, Conv, [64, 3, 2]] # 9 (1, 64, 320, 320) - (16)
  - [-1, 1, Conv, [128, 3, 2]] # 10 (1, 128, 160, 160) - (32)
  - [-1, 2, DWC3k2, [256, False, 0.25]] # 11 (1, 256, 80, 80) - (64)
  - [-1, 1, Conv, [256, 3, 2]] # 12 (1, 256, 80, 80) - (64) - multiscale 1
  - [-1, 2, DWC3k2, [512, False, 0.25]] #13 (1, 512, 40, 40) - (128)
  - [-1, 1, Conv, [512, 3, 2]] # 14 (1, 512, 40, 40) - (128)
  - [-1, 2, DWC3k2, [512, True]] #15 (1, 512, 40, 40) - (128) - multiscale 2
  - [-1, 1, Conv, [1024, 3, 2]] # 16 (1, 1024, 20, 20) - (256)
  - [-1, 2, DWC3k2, [1024, True]] #17 (1, 1024, 20, 20) - (256)
  - [-1, 1, SPPF, [1024, 5]] #18 multisclae 3
    
  #Concat
  - [[3, 12], 1, Concat, [1]] # 19 (1, 448, 80, 80)  (256)
  - [-1, 1, ECA, []]  #20
  
  - [[5, 15], 1, Concat, [1]] # 21 (1, 896, 40, 40) (512)
  - [-1, 1, ECA, []] #22

  - [[8, 18], 1, Concat, [1]] #23 (1, 1792, 20, 20) (1024)
  - [-1, 1, ECA, []]  #24

  - [23, 1, Conv, [1024, 3, 2]] #25 10
  - [-1, 1, Conv, [512, 3, 2]] #26 5

head:
#BiFPN BLOCK 1
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #27
  - [[-1, 25], 1, BiFPN_Concat2, [1]] # 28 1024+512 = 1536
  - [-1, 3, DWC3k2, [512]] # 29 128

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #30
  - [[-1, 24], 1, BiFPN_Concat2, [1]] # 31
  - [-1, 3, DWC3k2, [256]] # 32

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #33
  - [[-1, 22], 1, BiFPN_Concat2, [1]] # 34
  - [-1, 3, DWC3k2, [128]] # 35

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #36
  - [[-1, 20], 1, BiFPN_Concat2, [1]] # 37
  - [-1, 3, DWC3k2, [64]] # 38

  - [-1, 1, nn.Upsample, [None, 0.5, "nearest"]] #39
  - [[-1, 35, 22], 1, BiFPN_Concat3, [1]] # 40
  - [-1, 3, DWC3k2, [128, True]] # 41
  
  - [-1, 1, nn.Upsample, [None, 0.5, "nearest"]] #42
  - [[-1, 32, 24], 1, BiFPN_Concat3, [1]] # 43
  - [-1, 3, DWC3k2, [512, True]] # 44
  
  - [-1, 1, nn.Upsample, [None, 0.5, "nearest"]] #45
  - [[-1, 29, 25], 1, BiFPN_Concat3, [1]] # 46
  - [-1, 3, DWC3k2, [1024, True]] # 47

  - [-1, 1, nn.Upsample, [None, 0.5, "nearest"]] #48
  - [[-1, 26], 1, BiFPN_Concat2, [1]] # 49
  - [-1, 3, DWC3k2, [1024, True]] # 50

# #BiFPN Block 2

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #51
  - [[-1, 47], 1, BiFPN_Concat2, [1]] # 52
  - [-1, 3, DWC3k2, [512]] # 29 53

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #54
  - [[-1, 44], 1, BiFPN_Concat2, [1]] # 55
  - [-1, 3, DWC3k2, [256]] # 56

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #57
  - [[-1, 41], 1, BiFPN_Concat2, [1]] # 58
  - [-1, 3, DWC3k2, [128]] # 59

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #60
  - [[-1, 38], 1, BiFPN_Concat2, [1]] # 61
  - [-1, 3, DWC3k2, [64]] # 62

  - [-1, 1, nn.Upsample, [None, 0.5, "nearest"]] #63
  - [[-1, 41, 59], 1, BiFPN_Concat3, [1]] # 64
  - [-1, 3, DWC3k2, [128, True]] # 65
  
  - [-1, 1, nn.Upsample, [None, 0.5, "nearest"]] #66
  - [[-1, 44, 56], 1, BiFPN_Concat3, [1]] # 67
  - [-1, 3, DWC3k2, [512, True]] # 68
  
  - [-1, 1, nn.Upsample, [None, 0.5, "nearest"]] #69
  - [[-1, 47, 53], 1, BiFPN_Concat3, [1]] # 70
  - [-1, 3, DWC3k2, [1024, True]] # 71

  - [-1, 1, nn.Upsample, [None, 0.5, "nearest"]] #72
  - [[-1, 50], 1, BiFPN_Concat2, [1]] # 73
  - [-1, 3, DWC3k2, [1024, True]] # 74
  
# #BiFPN BLock 3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #75
  - [[-1, 71], 1, BiFPN_Concat2, [1]] # 76
  - [-1, 3, DWC3k2, [512]] # 29 77

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #78
  - [[-1, 68], 1, BiFPN_Concat2, [1]] # 79
  - [-1, 3, DWC3k2, [256]] # 80

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #81
  - [[-1, 65], 1, BiFPN_Concat2, [1]] # 82
  - [-1, 3, DWC3k2, [128]] # 83

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #84
  - [[-1, 62], 1, BiFPN_Concat2, [1]] # 85
  - [-1, 3, DWC3k2, [64]] # 86

  - [-1, 1, nn.Upsample, [None, 0.5, "nearest"]] #87
  - [[-1, 65, 83], 1, BiFPN_Concat3, [1]] # 88
  - [-1, 3, DWC3k2, [128, True]] # 89
  
  - [-1, 1, nn.Upsample, [None, 0.5, "nearest"]] #90
  - [[-1, 68, 75], 1, BiFPN_Concat3, [1]] # 91
  - [-1, 3, DWC3k2, [512, True]] # 92
  
  - [-1, 1, nn.Upsample, [None, 0.5, "nearest"]] #93
  - [[-1, 71, 77], 1, BiFPN_Concat3, [1]] # 94
  - [-1, 3, DWC3k2, [1024, True]] # 95

  - [-1, 1, nn.Upsample, [None, 0.5, "nearest"]] #96
  - [[-1, 74], 1, BiFPN_Concat2, [1]] # 97
  - [-1, 3, DWC3k2, [1024, True]] # 98

  - [[98, 95, 92, 89, 86], 1, Detect, [nc]] # 99
